Revit 2026 API

# FormRehost(Reference, XYZ) Method

---

Rehost Form to edge, face or curve.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Rehost(
	Reference hostRef,
	XYZ location
)
```
```vb
Public Sub Rehost (
	hostRef As Reference,
	location As XYZ
)
```
```cpp
public:
void Rehost(
	Reference^ hostRef,
	XYZ^ location
)
```
```fsharp
member Rehost :
        hostRef : Reference *
        location : XYZ -> unit
```

#### Parameters

hostRef Reference
    The geometry reference on which to rehost the form.
location XYZ
    The location to which to Rehost the form.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the hostRef or location is . |
| InvalidOperationException | Thrown when rehosting Form failed. |

#### Reference

Form Class

Rehost Overload

Autodesk.Revit.DB Namespace